** Defer

- Go's *defer* statement schedules a function call (the deferred
  function) to be run immediately before the function executing the
  defer returns.

Example code:

#+begin_src go-ts
  // Contents returns the file's contents as a string.
  func Contents(filename string) (string, error) {
      f, err := os.Open(filename)
      if err != nil {
          return "", err
      }
      defer f.Close()  // f.Close will run when we're finished.

      // Now do something with the file handle

      // Return some data
  }
#+end_src

- You can also defer multiple function executions:

#+begin_src go :imports '("fmt")
for i := 0; i < 5; i++ {
    defer fmt.Printf("%d ", i)
}
#+end_src

#+RESULTS:
: 4 3 2 1 0

- Deferred functions are executed in LIFO order. So the above code
  will cause ~4 3 2 1 0~ to be printed when the function returns.

* Slices

- Slices wrap arrays to give a more general, powerful, and convenient
  interface to sequences of data.
- If a function takes a slice argument, changes it makes to the
  elements of the slice will be visible to the caller, analogous to
  passing a pointer to the underlying array.

Two built in functions:
- *cap*: Returns the capacity of the slice. If slice is nil, returns 0.
- *len*: Returns the length of the slice. If slice is nill, returns 0.

Sample code using slice:

#+begin_src go :imports '("fmt") :results output
v := make([] int, 2)

v[1] = 2

fmt.Printf("%d ", v[0])
fmt.Printf("%d ", v[1])
#+end_src

#+RESULTS:
: 0 2

* Maps

- Built in data structure that associates value of one type (the key)
  with values of another type (the element or value).
- Can be constructed using composite literal syntax during
  initalization.
- An attempt to fetch a map value with a key that is not present in
  the map will return the zero value for the type of the entries in
  the map. So you're basically screwed if the map's value is actually
  zero.

#+begin_src go :imports '("fmt") :results output
var timeZone = map[string]int{
    "UTC":  0*60*60,
    "EST": -5*60*60,
    "CST": -6*60*60,
    "MST": -7*60*60,
    "PST": -8*60*60,
}

fmt.Printf("%d ", timeZone["EST"])
fmt.Printf("%d ", timeZone["UTC"])
fmt.Printf("%d ", timeZone["INVALID_KEY"])
#+end_src

#+RESULTS:
: -18000 0 0

To solve the above issue, they have a *comma ok* idiom:

#+begin_src go :results output
  package main

  import "fmt"
  import "log"

  var timeZone = map[string]int{
          "UTC":  0*60*60,
          "EST": -5*60*60,
          "CST": -6*60*60,
          "MST": -7*60*60,
          "PST": -8*60*60,
  }

  func offset(tz string) int {
          if seconds, ok := timeZone[tz]; ok {
                  return seconds
          }
          log.Println("unknown time zone:", tz)
          return 0
  }

  func main() {
          var utc int = offset("UTC")
          var unknown int = offset("UNKNOWN_KEY")
          fmt.Printf("%d ", utc)
          fmt.Printf("%d ", unknown)
  }
#+end_src

#+RESULTS:
: 0 0

* Append

- Function signature:

#+begin_src go
func append(slice []T, elements ...T) []T
#+end_src

- Has special compiler support.

#+begin_src go :imports '("fmt") :results output :exports both
var test string = "hello"
var test2 []string
var test3 []string

test2 = make([]string, 2)
test2[0] = "hello"
test2[1] = "hi"

fmt.Printf("%v\n", test)
fmt.Printf("%v\n", test2)
fmt.Printf("%v\n", test3)

test3 = append(test2, "dell")
fmt.Printf("%v\n", test2)

test2 = append(test2, "dell")
fmt.Printf("%v\n", test2)
#+end_src

#+RESULTS:
: hello
: [hello hi]
: []
: [hello hi]
